Revit 2024 API
TextNoteOptions Constructor
Overload List
Name | Description
TextNoteOptions()
 Default constructor; populates the options with their respective default values.
TextNoteOptions(ElementId)
 Constructs text options to create text of the given type.
See Also
TextNoteOptions Class
TextNoteOptions Members
Autodesk.Revit.DB Namespace